## Plan Result (1112: sbox_aria - Terraform Plan Apply)




<pre><code>Plan: 14 to add, 16 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_insights.example[&#34;00-af-active-ccd&#34;]
  * azurerm_application_insights.example[&#34;01-af-active-ccd&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;00-active-ack&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;00-active-pub&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-active-ack&#34;]
  * azurerm_eventhub.aria_active_topic[&#34;01-active-pub&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-active-ccd&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-active-ccd&#34;]
  * azurerm_service_plan.example[&#34;00-af-active-ccd&#34;]
  * azurerm_service_plan.example[&#34;01-af-active-ccd&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_account.xcutting[&#34;01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_application_insights.example["00-af-active-ccd"] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "uksouth"
      + name                                = "af-active-ccd-sbox00-uks-dlrm-01"
      + resource_group_name                 = "ingest00-main-sbox"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workspace_id                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-sbox"
    }

  # azurerm_application_insights.example["01-af-active-ccd"] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "uksouth"
      + name                                = "af-active-ccd-sbox01-uks-dlrm-01"
      + resource_group_name                 = "ingest01-main-sbox"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workspace_id                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest01-logAnalytics001-sbox"
    }

  # azurerm_eventhub.aria_active_topic["00-active-ack"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-active-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["00-active-pub"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-active-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["01-active-ack"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-active-ack-01-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest01-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest01-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_active_topic["01-active-pub"] will be created
  + resource "azurerm_eventhub" "aria_active_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-active-pub-01-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest01-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest01-main-sbox"
      + status              = "Active"
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-active-ccd"] will be created
  + resource "azurerm_key_vault_access_policy" "example-principal" {
      + id                  = (known after apply)
      + key_permissions     = [
          + "Get",
          + "List",
          + "Encrypt",
          + "Decrypt",
          + "Backup",
          + "Create",
          + "Delete",
          + "Import",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
          + "Release",
          + "Rotate",
        ]
      + key_vault_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + object_id           = (known after apply)
      + secret_permissions  = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + storage_permissions = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Purge",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-active-ccd"] will be created
  + resource "azurerm_key_vault_access_policy" "example-principal" {
      + id                  = (known after apply)
      + key_permissions     = [
          + "Get",
          + "List",
          + "Encrypt",
          + "Decrypt",
          + "Backup",
          + "Create",
          + "Delete",
          + "Import",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
          + "Release",
          + "Rotate",
        ]
      + key_vault_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox"
      + object_id           = (known after apply)
      + secret_permissions  = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + storage_permissions = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Purge",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_linux_function_app.example["00-af-active-ccd"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-active-ccd-sbox00-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest00-main-sbox"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest00xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.11"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox00-uks-dlrm-01"
      ~ tags                                           = {
            "application"                            = "dlrm-data-ingest"
            "builtFrom"                              = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                           = "cross-cutting"
            "criticality"                            = "Low"
            "environment"                            = "sandbox"
            "expiresAfter"                           = "3000-01-01"
          - "hidden-link: /app-insights-resource-id" = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/microsoft.insights/components/af-aplfpa-sbox00-uks-dlrm-01" -> null
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01"
        name                                           = "af-aplfta-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01"
        name                                           = "af-apluta-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox00-uks-dlrm-01"
        name                                           = "af-bails-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox00-uks-dlrm-01"
        name                                           = "af-joh-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox00-uks-dlrm-01"
        name                                           = "af-sbails-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-td-sbox00-uks-dlrm-01"
        name                                           = "af-td-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-active-ccd"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-active-ccd-sbox01-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest01-main-sbox"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest01xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.11"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_linux_function_app.example["01-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox01-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox01-uks-dlrm-01"
      ~ tags                                           = {
            "application"                            = "dlrm-data-ingest"
            "builtFrom"                              = "hmcts/dlrm-data-ingest-aria"
            "businessArea"                           = "cross-cutting"
            "criticality"                            = "Low"
            "environment"                            = "sandbox"
            "expiresAfter"                           = "3000-01-01"
          - "hidden-link: /app-insights-resource-id" = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/microsoft.insights/components/af-aplfpa-sbox01-uks-dlrm-01" -> null
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox01-uks-dlrm-01"
        name                                           = "af-aplfta-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox01-uks-dlrm-01"
        name                                           = "af-apluta-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox01-uks-dlrm-01"
        name                                           = "af-bails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox01-uks-dlrm-01"
        name                                           = "af-joh-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox01-uks-dlrm-01"
        name                                           = "af-sbails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-td-sbox01-uks-dlrm-01"
        name                                           = "af-td-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_service_plan.example["00-af-active-ccd"] will be created
  + resource "azurerm_service_plan" "example" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "af-active-ccd-sbox00-uks-dlrm-01"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "ingest00-main-sbox"
      + sku_name                        = "EP1"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + worker_count                    = (known after apply)
    }

  # azurerm_service_plan.example["01-af-active-ccd"] will be created
  + resource "azurerm_service_plan" "example" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "af-active-ccd-sbox01-uks-dlrm-01"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "ingest01-main-sbox"
      + sku_name                        = "EP1"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + worker_count                    = (known after apply)
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingsbox"
        name                               = "ingest00xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.xcutting["01"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01xcuttingsbox"
        name                               = "ingest01xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

Plan: 14 to add, 16 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 1112: sbox_aria - Terraform Plan Apply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-aria/issues/187/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":187,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->